Revit 2026 API
LocationPoint.Point Property
The physical location of the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public XYZ Point { get; set; }
Public Property Point As XYZ
	Get
	Set
public:
property XYZ^ Point {
	XYZ^ get ();
	void set (XYZ^ value);
}
member Point : XYZ with get, set
Property Value
XYZ
Remarks
Setting this property is not supported for some elements supporting LocationPoints, such as SpotDimensions.
See Also
Reference
LocationPoint Class
Autodesk.Revit.DB Namespace